<!--Дневник проекта-->
<pre>
    19.12.20
    - Исправил класс Config
    - Создал класс Page
        - Создание полей
        - Создание методов
            - setPropery
            - getPropery
            - showPropery
        
</pre>
<pre>
    28.12.20
    - Подправил наследование класса Page, и подступность полей и методов
    - Переделал пользовательский конструктор
    - Создал функцию getMacro для формирования макроса
    - Реализовал get, set, show для property
    - Реализовал add, show для js
    - Реализовал add, show для css
    - Реализовал add, show для string
    - Создал функцию getAllReplace для формирования массива для замены (макрос => значение) 
    - Создал функцию getStr для преобразования готового массива в строку
    - Создал функцию getStr getGroupingProperty для формирования массива property(макрос => значение) 
</pre>